Repository: SJasonP/HistoryLib
Catalog: HistoryLib/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: A connection is required. Changes are saved on this device until you are back online.
zh_hans: 需要网络连接。更改已保存在此设备，联网后将自动同步。

source: Auto Detect
zh_hans: 自动检测

source: Average Per Day
zh_hans: 平均每天

source: Average Per Month
zh_hans: 平均每月

source: Average Per Year
zh_hans: 平均每年

source: Batch Delete
zh_hans: 批量删除

source: Batch delete failed: %@
zh_hans: 批量删除失败：%@

source: Cancel
zh_hans: 取消

source: Cancel Export
zh_hans: 取消导出

source: Cancel Import
zh_hans: 取消导入

source: Cancelling export...
zh_hans: 正在取消导出…

source: Cancelling import...
zh_hans: 正在取消导入…

source: Cancelling...
zh_hans: 正在取消……

source: Cannot %@ because iCloud is unavailable. Changes are paused to keep your history consistent.
zh_hans: 无法%@，因为 iCloud 不可用。更改已暂停，以保持历史记录一致。

source: Cannot %@ until you relaunch HistoryLib to apply the iCloud Sync change. History changes are blocked until then so on-device data does not diverge.
zh_hans: 在重新启动 HistoryLib 应用 iCloud 同步更改之前，无法%@。在此之前历史更改将被阻止，以免设备上的数据发生分歧。

source: Check iCloud Sync
zh_hans: 检查iCloud云同步

source: Chunk checksum validation failed: %@
zh_hans: 分块校验和验证失败：%@

source: Clear Cache
zh_hans: 清除缓存

source: Cloud Sync Unavailable
zh_hans: 云同步暂不可用

source: Compressing archive...
zh_hans: 正在压缩归档…

source: Confirm Batch Delete
zh_hans: 确认批量删除

source: Continuing will also turn off Show Site Icons. Do you want to continue?
zh_hans: 继续操作还会关闭“显示网站图标”。是否继续？

source: Controls how far groups are expanded on launch.
zh_hans: 控制启动时分组的展开层级。

source: Data
zh_hans: 数据

source: Day
zh_hans: 日

source: Default Expand To
zh_hans: 默认展开至

source: Delete
zh_hans: 删除

source: Delete %lld Records
zh_hans: 删除 %lld 条记录

source: Delete Result
zh_hans: 删除记录

source: Delete Time Range
zh_hans: 删除的时间范围

source: Delete failed: %@
zh_hans: 删除失败：%@

source: Detected format: %@
zh_hans: 检测到的格式：%@

source: Display
zh_hans: 显示

source: Displays HH:mm:ss on each history row.
zh_hans: 在每条历史记录行显示 HH:mm:ss。

source: Displays website icons and fetches favicon files.
zh_hans: 显示网站图标并获取 favicon 文件。

source: Do Not Expand
zh_hans: 不展开

source: Enable Deletion
zh_hans: 启用删除

source: Enable iCloud Sync
zh_hans: 启用 iCloud 同步

source: End
zh_hans: 结束

source: Export
zh_hans: 导出

source: Export Result
zh_hans: 导出结果

source: Export complete.
zh_hans: 导出完成。

source: Export completed.
zh_hans: 导出完成。

source: Export failed: %@
zh_hans: 导出失败：%@

source: Exporting records (%lld/%lld)...
zh_hans: 正在导出记录（%1$lld/%2$lld）…

source: Exporting records...
zh_hans: 正在导出记录…

source: Extracting archive...
zh_hans: 正在解压归档…

source: Failed files: %lld
zh_hans: 失败文件数：%lld

source: Failed to create ZIP archive at destination URL.
zh_hans: 在目标 URL 创建 ZIP 归档失败。

source: Failed to load directory: %@
zh_hans: 加载目录失败：%@

source: Failed to load search results: %@
zh_hans: 加载搜索结果失败：%@

source: Failed to open ZIP archive for import.
zh_hans: 打开要导入的 ZIP 归档失败。

source: Failed to unzip archive: %@
zh_hans: 解压归档失败：%@

source: Format
zh_hans: 格式

source: HistoryLib Archive (.hlz)
zh_hans: HistoryLib 归档（.hlz）

source: HistoryLib export always uses one optimized .hlz archive format.
zh_hans: HistoryLib导出格式为固定的优化过的.hlz存档格式。

source: HistoryLib import supports .hlz, .zip, or a directory.
zh_hans: HistoryLib 导入支持 .hlz、.zip 或文件夹。

source: Import
zh_hans: 导入

source: Import (Auto Detect)
zh_hans: 导入（自动识别）

source: Import Result
zh_hans: 导入结果

source: Import Safari JSON/folder/ZIP files or a HistoryLib .hlz archive.
zh_hans: 导入Safari的JSON/文件夹/ZIP文件或者HistoryLib .hlz存档文件。

source: Import as HistoryLib Archive
zh_hans: 导入HistoryLib存档

source: Import as Safari Export
zh_hans: 导入Safari导出结果

source: Import history to generate a summary snapshot.
zh_hans: 导入历史记录以生成概览。

source: Imported records: %lld
zh_hans: 已导入记录数：%lld

source: Importing records (%lld)...
zh_hans: 正在导入记录（%lld）…

source: Importing records (%lld/%lld)...
zh_hans: 正在导入记录（%1$lld/%2$lld）…

source: Invalid HistoryLib manifest format.
zh_hans: HistoryLib manifest 格式无效。

source: Invalid archive path: %@
zh_hans: 归档路径无效：%@

source: Invalid chunk record at %@: line %lld.
zh_hans: 分块记录无效（%1$@）：第 %2$lld 行。

source: Invalid chunks index in HistoryLib archive.
zh_hans: HistoryLib 归档中的分块索引无效。

source: Last Modified
zh_hans: 最后修改于

source: Layout
zh_hans: 布局

source: Library
zh_hans: 库

source: Load More
zh_hans: 加载更多

source: Loading directory...
zh_hans: 正在加载目录……

source: Loading records...
zh_hans: 正在加载记录……

source: Loading...
zh_hans: 正在加载……

source: Manage
zh_hans: 管理

source: Manifest validation failed for %@: expected %lld, actual %lld.
zh_hans: 清单校验失败（%1$@）：期望 %2$lld，实际 %3$lld。

source: Missing required chunk index for HistoryLib archive.
zh_hans: HistoryLib 归档缺少必需的分块索引。

source: Month
zh_hans: 月

source: No History Records
zh_hans: 没有历史记录

source: No HistoryLib chunk files were found.
zh_hans: 未找到 HistoryLib 分块文件。

source: No HistoryLib manifest.json file was found.
zh_hans: 未找到 HistoryLib 的 manifest.json 文件。

source: No Matching Results
zh_hans: 没有匹配的记录

source: No Summary Snapshot
zh_hans: 没有概览

source: No records loaded.
zh_hans: 没有已加载数据。

source: No site data.
zh_hans: 没有站点数据。

source: Offline. Changes are saved on this device and will sync when you are back online.
zh_hans: 已离线。更改已保存在此设备，联网后将自动同步。

source: One File Per Day
zh_hans: 每天一个文件

source: One File Per Month
zh_hans: 每月一个文件

source: One File Per Year
zh_hans: 每年一个文件

source: Online. iCloud sync should proceed automatically.
zh_hans: 已联网。iCloud 同步应会自动进行。

source: Only .json files, directories, or .zip files are supported.
zh_hans: 仅支持 .json 文件、文件夹或 .zip 文件。

source: Open Link On Tap/Click
zh_hans: 点按/点击时打开链接

source: Opening
zh_hans: 正在打开

source: Opens the selected URL in your default browser.
zh_hans: 在默认浏览器中打开所选 URL。

source: Preparing Export...
zh_hans: 正在准备导出……

source: Preparing export...
zh_hans: 正在准备导出…

source: Preparing import...
zh_hans: 正在准备导入…

source: Relaunch required to apply the iCloud Sync change. History changes are blocked.
zh_hans: 需要重新启动以应用 iCloud 同步更改。历史更改已被阻止。

source: Safari Export
zh_hans: Safari 导出

source: Scanned files: %lld
zh_hans: 扫描文件数：%lld

source: Search
zh_hans: 搜索

source: Search keywords
zh_hans: 搜索关键词

source: Searching...
zh_hans: 正在搜索……

source: Settings
zh_hans: 设置

source: Show Site Icons
zh_hans: 显示网站图标

source: Show Visit Time
zh_hans: 显示访问时间

source: Single File
zh_hans: 单个文件

source: Skipped records: %lld
zh_hans: 已跳过记录数：%lld

source: Start
zh_hans: 开始

source: Summary
zh_hans: 概览

source: Sync Result
zh_hans: 同步结果

source: Sync failed: %@
zh_hans: 同步失败：%@

source: Sync status is unknown. iCloud sync is managed by the system.
zh_hans: 同步状态未知。iCloud 同步由系统管理。

source: This action cannot be undone.
zh_hans: 此操作无法撤销。

source: This will clear favicon cache files. Do you want to continue?
zh_hans: 这将清除网站图标缓存文件。是否继续？

source: Today
zh_hans: 今天

source: Top 10 Most Visited Sites
zh_hans: 最常访问10大站点

source: Total Records
zh_hans: 全部记录

source: Try a different keyword.
zh_hans: 换一个关键词试试。

source: Unsupported HistoryLib format version: %lld.
zh_hans: 不支持的 HistoryLib 格式版本：%lld。

source: Valid files: %lld
zh_hans: 有效文件数：%lld

source: Validating archive...
zh_hans: 正在校验归档…

source: When enabled on iOS, swipe left on a row to reveal Delete.
zh_hans: 在 iOS 上启用后，向左滑动行即可显示删除。

source: When off, the app uses local-only storage and skips all iCloud operations.
zh_hans: 关闭后，应用将仅使用本地存储并跳过所有 iCloud 操作。

source: Year
zh_hans: 年

source: Yesterday
zh_hans: 昨天

source: ZIP archive contains unsupported symbolic link entries.
zh_hans: ZIP 归档包含不支持的符号链接条目。

source: ZIP entry path is outside destination directory.
zh_hans: ZIP 条目路径超出目标目录范围。

source: check iCloud sync
zh_hans: 检查 iCloud 同步

source: delete records
zh_hans: 删除记录

source: iCloud Sync was turned off. Relaunch HistoryLib to apply the change. History changes are blocked until then so on-device data does not diverge.
zh_hans: iCloud 同步已关闭。请重新启动 HistoryLib 以应用更改。在此之前历史更改将被阻止，以免设备上的数据发生分歧。

source: iCloud Sync was turned on. Relaunch HistoryLib to apply the change. History changes are blocked until then so on-device data does not diverge.
zh_hans: iCloud 同步已开启。请重新启动 HistoryLib 以应用更改。在此之前历史更改将被阻止，以免设备上的数据发生分歧。

source: iCloud is currently unavailable. Changes are paused so your history stays consistent across your devices.
zh_hans: iCloud 当前不可用。更改已暂停，以保持各设备上的历史记录一致。

source: iCloud is unavailable. Changes are paused.
zh_hans: iCloud 不可用，更改已暂停。

source: iCloud sync is disabled in Settings.
zh_hans: 已在设置中关闭 iCloud 同步。

source: iCloud sync is disabled in Settings. History changes are stored locally on this device.
zh_hans: 已在设置中关闭 iCloud 同步。历史更改将存储在此设备本地。

source: iCloud sync is on.
zh_hans: iCloud 同步已开启。

source: iCloud sync is on. Records on this device: %lld %@
zh_hans: iCloud 同步已开启。 此设备上的记录数：%1$lld %2$@

source: iCloud unavailable. Changes are paused.
zh_hans: iCloud 不可用，更改已暂停。

source: import
zh_hans: 导入
